{
    "Glossary": {
        "Python": "A high-level, interpreted programming language known for its readability and broad applicability in fields such as data science, web development, and automation.",
        "Java": "A class-based, object-oriented programming language designed to be portable across platforms.",
        "C++": "An extension of C programming language that includes object-oriented, generic, and functional features.",
        "Ruby": "A dynamic, open-source programming language with a focus on simplicity and productivity.",
        "Swift": "A programming language developed by Apple for iOS and macOS development.",
        "PHP": "A popular general-purpose scripting language especially suited for web development.",
        "TypeScript": "A strict syntactical superset of JavaScript that adds optional static typing.",
        "Kotlin": "A modern programming language that interoperates with Java and is used for Android development.",
        "R": "A programming language and environment commonly used for statistical computing and graphics.",
        "JavaScript": "JavaScript is the world's most popular programming language",
        "CSS": "CSS is the language we use to style an HTML document.",
        
        "React": "A JavaScript library for building user interfaces.",
        "Angular": "A TypeScript-based open-source web application framework developed by Google.",
        "Vue.js": "An open-source JavaScript framework for building user interfaces and single-page applications.",
        "Django": "A high-level Python web framework that encourages rapid development and clean, pragmatic design.",
        "Flask": "A micro web framework written in Python, known for its simplicity and flexibility.",
        "Spring": "A powerful, lightweight Java framework used for building enterprise-level applications.",
        "Express.js": "A minimal and flexible Node.js web application framework providing robust features for web and mobile applications.",
        "Laravel": "A PHP framework that provides an elegant syntax and tools for web application development.",
        "Ruby on Rails": "A server-side web application framework written in Ruby.",
        
        "SQL": "Structured Query Language, a standard language for managing relational databases.",
        "MongoDB": "A NoSQL database known for its flexibility and scalability in handling large datasets.",
        "PostgreSQL": "An advanced, open-source relational database known for its reliability and feature set.",
        "Firebase": "A platform developed by Google for creating mobile and web applications, offering real-time database features.",
        "SQLite": "A self-contained, high-reliability, embedded, full-featured SQL database engine.",
        
        "Today": "Refers to the current day.",
        "Yesterday": "Refers to the day before the current day.",
        "Tomorrow": "Refers to the day after the current day.",
        "Noon": "12:00 PM, midday.",
        "Midnight": "12:00 AM, the start of a new day.",
        "Hour": "A unit of time equal to 60 minutes.",
        "Minute": "A unit of time equal to 60 seconds.",
        "Second": "A base unit of time in the International System of Units (SI).",
        
        "Algorithm": "A process or set of rules to be followed in calculations or other problem-solving operations, especially by a computer.",
        "Function": "A block of organized, reusable code used to perform a single, related action.",
        "Variable": "A storage location identified by a memory address and a symbolic name, which contains some known or unknown quantity of information referred to as a value.",
        "Loop": "A programming construct that repeats a block of code until a certain condition is met.",
        "Array": "A collection of items stored at contiguous memory locations.",
        "Class": "A blueprint for creating objects, providing initial values for state and implementations of behavior.",
        "Object": "An instance of a class, containing data and methods to operate on that data.",
        
        "Monday": "The first day of the week in many cultures, often considered the start of the work week.",
        "Tuesday": "The second day of the week.",
        "Wednesday": "The third day of the week, commonly referred to as 'hump day.'",
        "Thursday": "The fourth day of the week.",
        "Friday": "The fifth day of the week, often associated with the end of the work week.",
        "Saturday": "The sixth day of the week, commonly a weekend day.",
        "Sunday": "The seventh day of the week, commonly a weekend day and often a day of rest.",
        
        "January": "The first month of the year.",
        "February": "The second month of the year, known for Valentine's Day.",
        "March": "The third month of the year.",
        "April": "The fourth month of the year.",
        "May": "The fifth month of the year.",
        "June": "The sixth month of the year.",
        "July": "The seventh month of the year.",
        "August": "The eighth month of the year.",
        "September": "The ninth month of the year.",
        "October": "The tenth month of the year, known for Halloween.",
        "November": "The eleventh month of the year, known for Thanksgiving in the United States.",
        "December": "The twelfth month of the year, known for winter holidays such as Christmas.",
        
        "AM": "Indicates time from midnight to noon in the 12-hour clock system.",
        "PM": "Indicates time from noon to midnight in the 12-hour clock system."
    }
}
